pizzaapi/app/controllers/restaurants_controller.rb

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" IN (?, ?, ?)  [["id", 18], ["id", 2], ["id", 6]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        @restaurant = Restaurant.includes(:pizzas).find_by(id: params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      def destroy
        @restaurant = Restaurant.find_by(id: params[:id])